<?php

if (! defined ( 'BASEPATH' ))
	exit ( 'No direct script access allowed' );
/**
 *
 * @author lixin <lixin.xxx@gmail.com>
 *         @date 2015年7月15日
 *        
 */
$result = array (
		12000001=>'登录已经失效',
		12000002=>'登录状态错误',
		12000003=>'参数不能为空',
		12000004=>'参数格式错误',
		12000005=>'数据库操作失败',
		12000006=>'操作过于频繁',
		12000007=>'结果集为空',
		12000008=>'Memcache不可用',
		12000009=>'参数不合法',
		12000010=>'结果集已存在',

		//登录
		12001001=>'验证码已经失效',
		12001002=>'验证码有误，请重新输入',
		12001003=>'用户不存在',
		12001004=>'密码错误',
		12001005=>'用户不可用',
		12001006=>'手机号不可用',
		12001007=>'短信发送失败',
		12001008=>'Token验证码错误!',
		12001009=>'验证码发送过于频繁',
		12001010=>'用户不可用',

		//聊天室
		12002001=>'融云封禁用户失败',
		12002002=>'融云解封用户失败',
		12002003=>'群组不存在',
		12002004=>'运营人员关注群组成功',
		12002005=>'融云用户禁言失败',
		12002006=>'融云用户解除禁言失败',
		12002007=>'用户禁言时间过长',
		12002008=>'memcache用户缓存信息不存在',
		12002009=>'取消关注关系不存在',

		//包车报价系统
		12003001=>'此城市已经存在此车型',
		12003002=>'此车型暂无价格规则',
		12003003=>'此城市暂无有效车型',
		12003004=>'线路名称已经存在',

		//包车3.0
		12003006=>'报价并派单操作失败',
		//企业支付
		12005001=>'关联线路失败',
		12005002=>'编辑线路关联失败',
		12005003=>'取消线路关联失败',
		//迟到赔付
		12006001=>'发送代金券失败,请重试',
);

$config ['result'] = $result;